Nozzletest/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5+                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
scale 0.001;

D_ex 10000;

inj_h 25;
inj_r 3;

nx_conv1 20;
nx_conv2 20;
nx_preinj 30;
nx_inj 20;
nx_postinj 10;
nx 20;

ny_inj 20;
ny 20;
ny_noz_tb 5;
ny_noz_lr 20;

nz 15;
nz_inj 20;
nz_noz_tblr 20;

radinl 28.284271; // inlet coord
radth  6.872068; // throat coord
radex  13.58105;  // exit coord

Radex 2000; 

rot  45; // orientation of the points



vertices
(
     ( -130    -$radinl    -$radinl  )    // 0
     ( -130     $radinl    -$radinl )    // 1
     (  -60    -$radinl    -$radinl )    // 2
     (  -60     $radinl   -$radinl )    // 3
     (    0  -$radth    -$radth  )    // 4
     (    0   $radth    -$radth  )    // 5
     (  100    -$radex    -$radex  )    // 6
     (  100     $radex    -$radex  )    // 7


     ( -130    -$radinl   $radinl )    // 8
     ( -130     $radinl   $radinl )    // 9
     (  -60    -$radinl   $radinl )    // 10
     (  -60     $radinl   $radinl )    // 11
     (    0  -$radth    $radth  )    // 12
     (    0   $radth    $radth  )    // 13
     (  100    -$radex  $radex  )    // 14
     (  100     $radex   $radex  )    // 15


    (   87.8787  -12.7100    -12.7100  )    // 16
    (   87.8787   12.7100    -12.7100  )    // 17
     (   92.1213  -13.1124    -13.1124  )    // 18
     (   92.1213   13.1124    -13.1124  )    // 19


    (   87.8787  -12.7100    12.7100 )    // 20
    (   87.8787   12.7100    12.7100  )    // 21
    (   92.1213  -13.1124    13.1124  )    // 22
    (   92.1213   13.1124    13.1124 )    // 23


     (   87.8787  -12.7100    -2.1213  )    // 24
     (   87.8787  12.7100    -2.1213  )    // 25
     (   92.1213  -13.1124    -2.1213 )    // 26
     (   92.1213   13.1124    -2.1213  )    // 27
     (   87.8787  -12.7100    2.1213  )    // 28
     (   87.8787   12.7100    2.1213  )    // 29
     (   92.1213  -13.1124    2.1213  )    // 30
     (   92.1213   13.1124    2.1213  )    // 31
     (   87.8787   25   -2.1213  )     // 32
     (   92.1213   25   -2.1213  )    // 33
     (   87.8787   25    2.1213  )     // 34
     (   92.1213   25    2.1213  )    // 35


    (   -130     $radinl    -2.1213  )   // 36
    (   -60     $radinl    -2.1213  )    // 37
    (   0     $radth    -2.1213  )  // 38
    (   100     $radex    -2.1213  )   // 39

    (   -130     $radinl    2.1213  )   // 40
    (   -60     $radinl    2.1213  )    // 41
    (   0     $radth    2.1213  )  // 42
    (   100     $radex    2.1213  )   // 43


     (   -130     -$radinl    -2.1213  )   // 44
    (   -60     -$radinl    -2.1213  )    // 45
    (   0     -$radth    -2.1213  )  // 46
    (   100     -$radex    -2.1213  )  // 47

    (   -130     -$radinl    2.1213  )   // 48
    (   -60     -$radinl    2.1213  )    // 49
    (   0     -$radth    2.1213  )  // 50
    (   100     -$radex    2.1213  )   // 51


    (   -130    39.9437    -2.1213  )   // 52
    (   -60     39.9437   -2.1213  )    // 53
    (   0     9.4857    -2.1213  )  // 54
    (   87.8787       17.9337    -2.1213  )   // 55
    (92.0650 18.3265 -2.1757)  // 56
    (   100     19.0905    -2.1213  )   // 57

        (   -130     39.9437    2.1213  )   // 58
    (   -60     39.9437    2.1213  )    // 59
    (   0     9.4857    2.1213  )  // 60
    (   87.8787     17.9337   2.1213  )   // 61 
    (92.1990 18.3547 2.0407)// 62
    (   100     19.0905     2.1213  )   // 63

    (   -130    -39.9437    -2.1213  )   // 64
    (   -60     -39.9437   -2.1213  )    // 65
    (   0     -9.4857    -2.1213  )  // 66
    (   87.8787       -17.8491    -2.1213  )   // 67
    (92.0650 -18.4220 -2.1213)  // 68
    (   100     -19.0905    -2.1213  )   // 69

    (   -130     -39.9437    2.1213  )   // 70
    (   -60     -39.9437    2.1213  )    // 71
    (   0     -9.4857    2.1213  )  // 72
    (   87.8787     -17.8491   2.1213  )   // 73  
    (92.1990 -18.4220 2.1213)// 74
    (   100     -19.0905     2.1213  )   // 75

 (  $D_ex    -$radex    -$radex  )    // 76
 (  $D_ex    $radex    -$radex  )    // 77
 (  $D_ex     $radex    -2.1213  )   // 78
 (  $D_ex     19.0905    -2.1213  )   // 79
 (  $D_ex     19.0905    2.1213  )   // 80
 (  $D_ex     $radex    2.1213  )   // 81
 (  $D_ex     $radex   $radex  )    // 82
 (  $D_ex    -$radex  $radex  )    // 83
 (  $D_ex     -$radex    2.1213  )   // 84 
 (  $D_ex     -19.0905    2.1213  )   // 85
 (  $D_ex     -19.0905    -2.1213  )   // 86
 (  $D_ex     -$radex    -2.1213  )  // 87 


 (  100    -$radex    -$Radex  )    // 88
 (  100    $radex    -$Radex  )    // 89
 (  100     $Radex    -2.1213  )   // 90
 (  100    $Radex    2.1213  )   // 91
 (  100    $radex   $Radex  )    // 92
 (  100    -$radex  $Radex )    // 93
 (  100     -$Radex    2.1213  )   // 94
 (  100    -$Radex   -2.1213  )   // 95


 (  $D_ex    -$radex    -$Radex  )    // 96
 (  $D_ex    $radex    -$Radex  )    // 97
 (  $D_ex     $Radex    -2.1213  )   // 98
 (  $D_ex    $Radex    2.1213  )   // 99
 (  $D_ex    $radex   $Radex  )    // 100
 (  $D_ex    -$radex  $Radex )    // 101
 (  $D_ex     -$Radex    2.1213  )   // 102
 (  $D_ex    -$Radex   -2.1213  )   // 103

 ( 100     -$Radex    -$radex  )  // 104 
 ( 100     $Radex    -$radex )   // 105
 ( 100     $Radex    $radex )   // 106
 ( 100     -$Radex    $radex  )   // 107

 (  $D_ex     -$Radex    -$radex  )  // 108
 (  $D_ex     $Radex    -$radex  )   // 109
 (  $D_ex     $Radex    $radex )   // 110
 (  $D_ex     -$Radex    $radex )   // 111

    (   -130    37.4166    -14.1421  )   // 112
    (   -60     37.4166    -14.1421   )    // 113
    (   0     9.0924   -3.4360  )  // 114
    (   87.8787       16.8138    -6.3550  )   // 115
    (92.0650 17.3460 -6.5562)  // 116
    (   100      17.9676    -6.7905  )   // 117


    (   -130    37.4166    14.1421  )   // 118
    (   -60     37.4166    14.1421   )    // 119
    (   0     9.0924   3.4360  )  // 120
    (   87.8787       16.8138    6.3550  )   // 121
    (92.0650 17.3460 6.5562)  // 122
    (   100      17.9676    6.7905  )   // 123

    (   -130    -37.4166    -14.1421  )   // 124
    (   -60     -37.4166    -14.1421   )    // 125
    (   0     -9.0924   -3.4360  )  // 126
    (   87.8787       -16.8138    -6.3550  )   // 127
    (92.0650 -17.3460 -6.5562)  // 128
    (   100      -17.9676    -6.7905  )   // 129

    (   -130    -37.4166    14.1421  )   // 130
    (   -60     -37.4166    14.1421   )    // 131
    (   0     -9.0924   3.4360  )  // 132
    (   87.8787       -16.8138    6.3550  )   // 133
    (92.0650 -17.3460 6.5562)  // 134
    (   100      -17.9676    6.7905  )   // 135

    (   $D_ex      17.9676    -6.7905  )   // 136
    (   $D_ex      17.9676    6.7905  )   // 137
    (   $D_ex      -17.9676    6.7905  )   // 138
    (   $D_ex      -17.9676    -6.7905  )   // 139

    (  100      2000   -6.7905  )   // 140
    (   100      2000   6.7905  )   // 141
    (   100      -2000    6.7905  )   // 142
    (   100      -2000    -6.7905  )   // 143

    (   $D_ex      2000   -6.7905  )   // 144
    (   $D_ex      2000   6.7905  )   // 145
    (   $D_ex      -2000    6.7905  )   // 146
    (   $D_ex      -2000    -6.7905  )   // 147

);


blocks
(

//conv1
    
    hex (1 3 113 112 36 37 53 52)  ( $nx_conv1 $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //0
    hex (36 37 53 52 40 41 59 58) ( $nx_conv1 $ny_noz_tb  $nz_inj) simpleGrading (1 1 1) //1
    hex (40 41 59 58 9 11 119 118)  ( $nx_conv1 $ny_noz_tb  $nz_noz_tblr)  simpleGrading (1 1 1) //2
  
    hex (0 2 3 1 44 45 37 36) ( $nx_conv1 $ny_noz_lr $nz_noz_tblr) simpleGrading (1 1 1) //3
    hex (44 45 37 36 48 49 41 40) ( $nx_conv1 $ny_noz_lr $nz_inj) simpleGrading (1 1 1) //4
    hex (48 49 41 40 8 10 11 9) ( $nx_conv1 $ny_noz_lr $nz_noz_tblr) simpleGrading (1 1 1) //5 

    hex (124 125 2 0 64 65 45 44) ( $nx_conv1 $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //6 
    hex (64 65 45 44 70 71 49 48 ) ( $nx_conv1 $ny_noz_tb  $nz_inj) simpleGrading (1 1 1) //7 
    hex (70 71 49 48 130 131 10 8) ( $nx_conv1 $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //8 

//conv 2
    
    hex (3 5 114 113 37 38 54 53)  ( $nx_conv2 $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //9
    hex (37 38 54 53 41 42 60 59) ( $nx_conv2 $ny_noz_tb  $nz_inj) simpleGrading (1 1 1) //10
    hex (41 42 60 59 11 13 120 119)  ( $nx_conv2 $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //11

    
    hex (2 4 5 3 45 46 38 37) ( $nx_conv2 $ny_noz_lr $nz_noz_tblr) simpleGrading (1 1 1) //12
    hex (45 46 38 37 49 50 42 41) ( $nx_conv2 $ny_noz_lr $nz_inj) simpleGrading (1 1 1) //13
    hex (49 50 42 41 10 12 13 11) ( $nx_conv2 $ny_noz_lr $nz_noz_tblr) simpleGrading (1 1 1) //14 

    hex (125 126 4 2 65 66 46 45 ) ( $nx_conv2 $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //15
    hex (65 66 46 45 71 72 50 49) ( $nx_conv2 $ny_noz_tb  $nz_inj)  simpleGrading (1 1 1) //16 
    hex (71 72 50 49 131 132 12 10)  ( $nx_conv2 $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //17 
    
// upstream injection
    
   hex (5 17 115 114 38 25 55 54 ) ( $nx_preinj $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //18
   hex (38 25 55 54 42 29 61 60 ) ( $nx_preinj $ny_noz_tb  $nz_inj) simpleGrading (1 1 1) //19
   hex (42 29 61 60 13 21 121 120 ) ( $nx_preinj $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //20
   
    hex (4 16 17 5 46 24 25 38) ( $nx_preinj $ny_noz_lr $nz_noz_tblr) simpleGrading (1 1 1) //21
    hex (46 24 25 38 50 28 29 42) ( $nx_preinj $ny_noz_lr $nz_inj) simpleGrading (1 1 1) //22
    hex (50 28 29 42 12 20 21 13) ( $nx_preinj $ny_noz_lr $nz_noz_tblr) simpleGrading (1 1 1) //23
 
 
   hex (126 127 16 4 66 67 24 46 ) ( $nx_preinj $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1)//24
   hex (66 67 24 46 72 73 28 50) ( $nx_preinj $ny_noz_tb  $nz_inj) simpleGrading (1 1 1)//25
   hex (72 73 28 50 132 133 20 12) ( $nx_preinj $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //26
  

// injection section
    
    hex (17 19 116 115 25 27 56 55) ( $nx_inj $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //27
    hex (25 27 56 55 29 31 62 61) ( $nx_inj $ny_noz_tb $nz_inj) simpleGrading (1 1 1) //28
    hex (29 31 62 61 21 23 122 121)  ( $nx_inj $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //29

    hex (16 18 19 17 24 26 27 25) ( $nx_inj $ny_noz_lr $nz_noz_tblr) simpleGrading (1 1 1) //30
    hex (24 26 27 25 28 30 31 29) ( $nx_inj $ny_noz_lr $nz_inj) simpleGrading (1 1 1) //31
    hex (28 30 31 29 20 22 23 21) ( $nx_inj $ny_noz_lr $nz_noz_tblr) simpleGrading (1 1 1) //32

    hex (127 128 18 16 67 68 26 24) ( $nx_inj $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //33
    hex (67 68 26 24 73 74 30 28) ( $nx_inj $ny_noz_tb $nz_inj) simpleGrading (1 1 1) //34
    hex (73 74 30 28 133 134 22 20)  ( $nx_inj $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //35
    
// injector
   hex (55 56 33 32 61 62 35 34) ( $nx_inj $ny_inj $nz_inj) simpleGrading (1 1 1) //37

// Post injection section
    hex (19 7 117 116 27 39 57 56) ( $nx_postinj $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //38
    hex (27 39 57 56 31 43 63 62) ( $nx_postinj $ny_noz_tb  $nz_inj) simpleGrading (1 1 1) //39
    hex (31 43 63 62 23 15 123 122) ( $nx_postinj $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //40

    hex (18 6 7 19 26 47 39 27) ( $nx_postinj $ny_noz_lr $nz_noz_tblr) simpleGrading (1 1 1) //41
    hex (26 47 39 27 30 51 43 31) ( $nx_postinj $ny_noz_lr $nz_inj) simpleGrading (1 1 1) //42
    hex (30 51 43 31 22 14 15 23) ( $nx_postinj $ny_noz_lr $nz_noz_tblr) simpleGrading (1 1 1) //43

    hex (128 129 6 18 68 69 47 26) ( $nx_postinj $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //44
    hex (68 69 47 26 74 75 51 30) ( $nx_postinj $ny_noz_tb $nz_inj) simpleGrading (1 1 1) //45
    hex (74 75 51 30 134 135 14 22)  ( $nx_postinj $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //46

// small exit cubes


    hex (7 77 136 117 39 78 79 57) ( $nx $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //38
    hex (39 78 79 57 43 81 80 63) ( $nx $ny_noz_tb  $nz_inj) simpleGrading (1 1 1) //39
    hex (43 81 80 63 15 82 137 123) ( $nx $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //40

   hex (6 76 77 7 47 87 78 39) ( $nx $ny_noz_lr $nz_noz_tblr) simpleGrading (1 1 1) //41
   hex (47 87 78 39 51 84 81 43) ( $nx $ny_noz_lr $nz_inj) simpleGrading (1 1 1) //42
   hex (51 84 81 43 14 83 82 15) ( $nx $ny_noz_lr $nz_noz_tblr) simpleGrading (1 1 1) //43

    hex (129 139 76 6 69 86 87 47 ) ( $nx $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //44
    hex (69 86 87 47 75 85 84 51) ( $nx $ny_noz_tb $nz_inj) simpleGrading (1 1 1) //45
    hex (75 85 84 51 135 138 83 14)  ( $nx $ny_noz_tb  $nz_noz_tblr) simpleGrading (1 1 1) //46
 // small exit cubes
  
   hex (88 96 97 89 6 76 77 7) ( $nx $ny_noz_lr $nz) simpleGrading (1 1 1) //41
   hex (14 83 82 15 93 101 100 92) ( $nx $ny_noz_lr  $nz) simpleGrading (1 1 1) //46
   hex (57 79 98 90 63 80 99 91) ( $nx $ny $nz_noz_tblr) simpleGrading (1 1 1) //43
   hex (95 103 86 69 94 102 85 75) ( $nx $ny $nz_noz_tblr) simpleGrading (1 1 1) //43



 hex (89 97 97 89 7 77 109 105) ( $nx $ny $nz ) simpleGrading (1 1 1) //43
 hex (7 77 109 105 117 136 144 140) ( $nx $ny $ny_noz_tb ) simpleGrading (1 1 1) //43
 hex (117 136 144 140 57 79 98 90) ( $nx $ny $nz_noz_tblr) simpleGrading (1 1 1) //43
 

 hex (63 80 99 91 123 137 145 141) ( $nx $ny $nz_noz_tblr) simpleGrading (1 1 1) //43
 hex (123 137 145 141 15 82 110 106 ) ( $nx $ny $ny_noz_tb ) simpleGrading (1 1 1) //43
 hex (15 82 110 106 92 100 100 92 ) ( $nx $ny $nz ) simpleGrading (1 1 1) //43


 hex (88 96 96 88 104 108 76 6 ) ( $nx $ny $nz) simpleGrading (1 1 1) //43
 hex (104 108 76 6 143 147 139 129) ( $nx $ny $ny_noz_tb) simpleGrading (1 1 1) //43
 hex (143 147 139 129 95 103 86 69) ( $nx $ny $nz_noz_tblr ) simpleGrading (1 1 1) //43


 hex (94 102 85 75 142 146 138 135 ) ( $nx $ny $nz_noz_tblr) simpleGrading (1 1 1) //43
 hex (142 146 138 135 107 111 83 14) ( $nx $ny $ny_noz_tb) simpleGrading (1 1 1) //43
 hex (107 111 83 14 93 101 101 93) ( $nx $ny $nz ) simpleGrading (1 1 1) //41


 
 //hex (63 80 99 91 15 82 110 106) ( $nx $ny $nz_noz_tblr) simpleGrading (1 1 1) //43
 //hex (104 108 76 6 95 103 86 69) ( $nx $ny $nz_noz_tblr) simpleGrading (1 1 1) //43
 //hex (94 102 85 75 107 111 83 14) ( $nx $ny $nz_noz_tblr) simpleGrading (1 1 1) //43

 // big exit cubes

  //hex (89 97 97 89 7 77 109 105) ( $nx $ny $nz ) simpleGrading (1 1 1) //41
  //hex (15 82 110 106 92 100 100 92) ( $nx $ny $nz ) simpleGrading (1 1 1) //41
  //hex (88 96 96 88 104 108 76 6) ( $nx $ny $nz ) simpleGrading (1 1 1) //41


);




edges
(  

// edge inlet   
   arc 0 1 ( -130  40  0) 
   arc 1 112 ( -130  40  0) 
    arc 112 52 ( -130  40  0) 
   arc 52 58 ( -130  40  0) 
   arc 58 118 ( -130  -40  0) 
   arc 118 9 ( -130  -40  0) 
   arc 9 8 ( -130   -40  0) 
   arc 8 130 ( -130  -40  0) 
  
   arc 130 70 ( -130  -40  0) 
   arc 70 64 ( -130  -40  0) 
   arc 64 124 ( -130  40  0) 
   arc 124 0 ( -130  40  0) 

//edge  compression
   arc 2 3 ( -60  40  0) 
   arc 3 113 ( -60  40  0) 
   arc 113 53 ( -60  40  0) 
   arc 53 59 ( -60  40  0) 
   arc 59 119 ( -60  -40 0 )
   arc 119 11 ( -60  -40 0 )
   arc 11 10 ( -60   -40  0) 
   arc 10 131 ( -60  -40  0) 
   arc 131 71 ( -60  -40  0)
   arc 71 65 ( -60  -40  0) 
   arc 65 125 ( -60  40  0) 
   arc 125 2 ( -60  40  0) 

//edge throat
  arc 4 5 ( 0  0  -9.72)
  arc 5 114 ( 0  9.72 0)
  arc 114 54 ( 0  9.72 0)
  arc 54 60 ( 0  9.72 0)
  arc 60 120 ( 0  -9.72 0)
  arc 120 13 ( 0  -9.72 0)
  arc 13 12 ( 0   -9.72 0) 
  arc 12 132 ( 0   -9.72 0) 
  arc 132 72 ( 0   -9.72 0)
  arc 72 66 ( 0  -9.72 0)
  arc 66 126 ( 0  9.72 0)
  arc 126 4 ( 0  9.72 0)



 arc 67 127 ( 87.8787  17.9747 0)
 arc 127 16 ( 87.8787  17.9747 0)
 arc 16 17 ( 87.8787  17.9747 0)
 arc 17 115 ( 87.8787  17.9747 0)
 arc 115 55 ( 87.8787  17.9747 0)
polyLine 61 55 (
 (87.8440 17.9337 2.0860)
 (87.7760 17.9355 2.0129)
 (87.7100 17.9376 1.9375)
 (87.6470 17.9397 1.8600)
 (87.5860 17.9420 1.7804)
 (87.5280 17.9444 1.6990)
 (87.4730 17.9468 1.6157)
 (87.4210 17.9492 1.5306)
 (87.3710 17.9517 1.4439)
 (87.3240 17.9542 1.3556)
 (87.2800 17.9566 1.2657)
 (87.2390 17.9589 1.1744)
 (87.2020 17.9612 1.0818)
 (87.1680 17.9633 0.9879)
 (87.1360 17.9652 0.8929)
 (87.1080 17.9670 0.7969)
 (87.0840 17.9687 0.7001)
 (87.0620 17.9701 0.6025)
 (87.0430 17.9714 0.5042)
 (87.0280 17.9725 0.4054)
 (87.0160 17.9733 0.3061)
 (87.0070 17.9740 0.2065)
 (87.0020 17.9744 0.1067)
 (87.0000 17.9746 0.0067)
 (87.0020 17.9744 -0.0933)
 (87.0060 17.9741 -0.1932)
 (87.0150 17.9734 -0.2928)
 (87.0260 17.9726 -0.3921)
 (87.0410 17.9715 -0.4910)
 (87.0590 17.9703 -0.5894)
 (87.0800 17.9689 -0.6871)
 (87.1050 17.9672 -0.7840)
 (87.1320 17.9655 -0.8801)
 (87.1630 17.9635 -0.9753)
 (87.1970 17.9614 -1.0693)
 (87.2340 17.9592 -1.1621)
 (87.2750 17.9569 -1.2536)
 (87.3180 17.9545 -1.3436)
 (87.3640 17.9520 -1.4321)
 (87.4140 17.9496 -1.5191)
 (87.4660 17.9471 -1.6044)
 (87.5210 17.9447 -1.6879)
 (87.5780 17.9423 -1.7696)
 (87.6390 17.9400 -1.8495)
 (87.7010 17.9378 -1.9272)
 (87.7670 17.9358 -2.0029)
 (87.8350 17.9340 -2.0763))
 arc 61 121 ( 87.8787  -17.9747 0)
 arc 121 21 ( 87.8787  -17.9747 0)
 arc 21 20 ( 87.8787  -17.9747 0)
 arc 20 133 ( 87.8787  -17.9747 0)
 arc 133 73 ( 87.8787  -17.9747 0)
 arc 73 67 ( 87.8787  -17.9747 0)


 arc 68 128 ( 92.1213  18.5437  0) 
 arc 128 18 ( 92.1213  18.5437  0) 
 arc 18 19 ( 92.1213  18.5437  0) 
 arc 19 116 ( 92.1213  18.5437  0)
 arc 116 56 ( 92.1213  18.5437  0)
polyLine 62 56 (
 (92.1990 18.3547 2.0407)
 (92.2650 18.3690 1.9669)
 (92.3280 18.3831 1.8909)
 (92.3890 18.3967 1.8129)
 (92.4480 18.4100 1.7329)
 (92.5040 18.4228 1.6511)
 (92.5570 18.4352 1.5674)
 (92.6080 18.4471 1.4820)
 (92.6560 18.4585 1.3949)
 (92.7010 18.4693 1.3062)
 (92.7420 18.4794 1.2160)
 (92.7810 18.4889 1.1244)
 (92.8170 18.4977 1.0314)
 (92.8500 18.5058 0.9371)
 (92.8790 18.5131 0.8418)
 (92.9050 18.5196 0.7456)
 (92.9280 18.5255 0.6485)
 (92.9480 18.5305 0.5506)
 (92.9650 18.5348 0.4521)
 (92.9790 18.5383 0.3531)
 (92.9890 18.5409 0.2537)
 (92.9960 18.5428 0.1540)
 (92.9990 18.5437 0.0540)
 (93.0000 18.5437 -0.0460)
 (92.9960 18.5429 -0.1459)
 (92.9900 18.5411 -0.2457)
 (92.9790 18.5385 -0.3451)
 (92.9660 18.5351 -0.4442)
 (92.9500 18.5309 -0.5427)
 (92.9300 18.5259 -0.6406)
 (92.9070 18.5201 -0.7378)
 (92.8810 18.5136 -0.8341)
 (92.8520 18.5064 -0.9295)
 (92.8200 18.4984 -1.0238)
 (92.7840 18.4897 -1.1169)
 (92.7460 18.4802 -1.2087)
 (92.7040 18.4701 -1.2990)
 (92.6590 18.4594 -1.3878)
 (92.6120 18.4481 -1.4750)
 (92.5610 18.4362 -1.5606)
 (92.5080 18.4239 -1.6444)
 (92.4520 18.4110 -1.7264)
 (92.3940 18.3978 -1.8066)
 (92.3330 18.3842 -1.8847)
 (92.2700 18.3702 -1.9608)
 (92.2040 18.3559 -2.0348)
 (92.1360 18.3413 -2.1065)
 (92.0650 18.3265 -2.1757))
 arc 62 122 ( 92.1213  -18.5437  0) 
 arc 122 23 ( 92.1213  -18.5437  0) 
 arc 23 22 ( 92.1213  -18.5437  0)
 arc 22 134 ( 92.1213  -18.5437  0)
 arc 134 74 ( 92.1213  -18.5437  0)
 arc 74 68 ( 92.1213  -18.5437  0) 
 

// injection inlet
 arc 32 34 ( 87   $inj_h   0)
 arc 34 35 ( 90   $inj_h   $inj_r)
 arc 35 33 ( 93   $inj_h  0)
 arc 33 32 ( 90   $inj_h   -$inj_r )

 arc 25 29 ( 87   12.7100   0)
 arc 29 31 ( 90   12.7100   3)
 arc 31 27 ( 93   12.7100   0)
 arc 27 25 ( 90   12.7100   -3)
polyLine 61 62(
 (87.9150 17.9321 2.15662)
 (87.9880 17.9308 2.22479)
 (88.0630 17.9297 2.29045)
 (88.1410 17.9289 2.35359)
 (88.2200 17.9285 2.41415)
 (88.3020 17.9284 2.47210)
 (88.3850 17.9287 2.52737)
 (88.4700 17.9294 2.57991)
 (88.5570 17.9305 2.62963)
 (88.6450 17.9320 2.67644)
 (88.7350 17.9341 2.72025)
 (88.8260 17.9366 2.76095)
 (88.9190 17.9397 2.79843)
 (89.0130 17.9434 2.83271)
 (89.1080 17.9476 2.86381)
 (89.2040 17.9523 2.89175)
 (89.3010 17.9576 2.91653)
 (89.3980 17.9635 2.93816)
 (89.4960 17.9699 2.95662)
 (89.5950 17.9768 2.97188)
 (89.6940 17.9843 2.98391)
 (89.7930 17.9924 2.99265)
 (89.8920 18.0010 2.99804)
 (89.9920 18.0103 2.99998)
 (90.0910 18.0201 2.99846)
 (90.1910 18.0305 2.99358)
 (90.2900 18.0414 2.98541)
 (90.3890 18.0528 2.97402)
 (90.4870 18.0647 2.95944)
 (90.5840 18.0769 2.94172)
 (90.6810 18.0896 2.92087)
 (90.7780 18.1027 2.89690)
 (90.8730 18.1162 2.86983)
 (90.9670 18.1300 2.83963)
 (91.0600 18.1441 2.80631)
 (91.1520 18.1585 2.76983)
 (91.2430 18.1732 2.73023)
 (91.3320 18.1881 2.68761)
 (91.4200 18.2032 2.64208)
 (91.5060 18.2184 2.59372)
 (91.5910 18.2337 2.54261)
 (91.6740 18.2490 2.48881)
 (91.7550 18.2644 2.43239)
 (91.8340 18.2797 2.37338)
 (91.9110 18.2950 2.31183)
 (91.9870 18.3102 2.24776)
 (92.0600 18.3253 2.18119)
 (92.1300 18.3401 2.11214))



polyLine 55 56 (
  (87.9050 17.9323 -2.14731)
  (87.9780 17.9309 -2.21582)
  (88.0530 17.9298 -2.28182)
  (88.1300 17.9290 -2.34529)
  (88.2100 17.9285 -2.40620)
  (88.2910 17.9284 -2.46450)
  (88.3740 17.9286 -2.52013)
  (88.4590 17.9292 -2.57304)
  (88.5450 17.9303 -2.62314)
  (88.6330 17.9318 -2.67035)
  (88.7230 17.9338 -2.71457)
  (88.8140 17.9362 -2.75569)
  (88.9070 17.9393 -2.79360)
  (89.0000 17.9428 -2.82831)
  (89.0950 17.9470 -2.85984)
  (89.1910 17.9517 -2.88820)
  (89.2880 17.9569 -2.91340)
  (89.3850 17.9627 -2.93545)
  (89.4830 17.9690 -2.95433)
  (89.5810 17.9759 -2.97002)
  (89.6800 17.9833 -2.98249)
  (89.7800 17.9913 -2.99167)
  (89.8790 17.9999 -2.99751)
  (89.9530 18.0066 -2.99964)
  (90.0000 18.0111 -3.00000)
  (90.0990 18.0209 -2.99828)
  (90.1990 18.0313 -2.99317)
  (90.2980 18.0423 -2.98475)
  (90.3960 18.0537 -2.97310)
  (90.4950 18.0656 -2.95826)
  (90.5920 18.0779 -2.94026)
  (90.6890 18.0907 -2.91913)
  (90.7850 18.1038 -2.89489)
  (90.8810 18.1173 -2.86754)
  (90.9750 18.1311 -2.83708)
  (91.0680 18.1452 -2.80348)
  (91.1600 18.1597 -2.76675)
  (91.2500 18.1744 -2.72690)
  (91.3390 18.1893 -2.68405)
  (91.4270 18.2044 -2.63829)
  (91.5130 18.2196 -2.58970)
  (91.5980 18.2349 -2.53837)
  (91.6800 18.2503 -2.48436)
  (91.7610 18.2656 -2.42773)
  (91.8400 18.2810 -2.36851)
  (91.9170 18.2963 -2.30675)
  (91.9930 18.3114 -2.24248))


//edge outlet

 arc 7 117 ( 100  0  19.2080)
 arc 117 57 ( 100  0  19.2080)
 arc 57 63 ( 100  0  19.2080)
 arc 63 123( 100   0  19.2080)
  arc 123 15( 100   0  19.2080) 
 arc 15 14 ( 100   0  19.2080) 
 arc 14 135 ( 100   0  -19.2080) 
 arc 135 75 ( 100   0  -19.2080) 
 arc 75 69 ( 100   0  -19.2080) 
 arc 69 129 ( 100   0  -19.2080) 
 arc 129 6 ( 100   0  -19.2080) 
 arc 6 7 ( 100  0  -19.2080)




 arc 77 136 ( $D_ex  0  19.2080)
 arc 136 79 ( $D_ex  0  19.2080)
 arc 79 80 ( $D_ex  0  19.2080)
 arc 80 137( $D_ex   0  19.2080)
 arc 137 82( $D_ex   0  19.2080) 
 arc 82 83 ( $D_ex   0  19.2080) 
 arc 83 138 ( $D_ex   0  -19.2080) 
 arc 138 85 ( $D_ex   0  -19.2080) 
 arc 85 86 ( $D_ex  0  -19.2080) 
 arc 86 139 ( $D_ex   0  -19.2080) 
 arc 139 76 ( $D_ex   0  -19.2080) 
 arc 76 77 ( $D_ex  0  -19.2080)

 arc 89 105 ( 100 $Radex 0)
 arc 105 140 ( 100  0 $Radex)
 arc 140 90 ( 100  0 $Radex)
 arc 90 91 ( 100  0 $Radex)
 arc 91 141 ( 100  0 $Radex)
 arc 141 106 ( 100  0 $Radex)
 arc 106 92 ( 100 0 $Radex)
 arc 92 93 ( 100 -$Radex 0 )
 arc 93 107 ( 100 -$Radex 0)
 arc 107 142 ( 100 $Radex 0)
 arc 142 94 ( 100 $Radex 0)
 arc 94 95 ( 100 0 -$Radex )
 arc 95 143 ( 100 0 -$Radex)
 arc 143 104 ( 100 0 -$Radex)
 arc 104 88 ( 100 0 -$Radex)
 arc 88 89 ( 100 $Radex 0)


 arc 97 109 ( $D_ex $Radex 0)
 arc 109 144 ( $D_ex  0 $Radex)
 arc 144 98 ( $D_ex  0 $Radex)
 arc 98 99 ( $D_ex  0 $Radex)
 arc 99 145 ( $D_ex  0 $Radex)
 arc 145 110 ( $D_ex  0 $Radex)
 arc 110 100 ( $D_ex 0 $Radex)
 arc 100 101 ( $D_ex -$Radex 0 )
 arc 101 111 ( $D_ex -$Radex 0)
 arc 111 146 ( $D_ex $Radex 0)
 arc 146 102 ( $D_ex $Radex 0)
 arc 102 103 ( $D_ex 0 -$Radex )
 arc 103 147 ( $D_ex 0 -$Radex)
 arc 147 108 ( $D_ex 0 -$Radex)
 arc 108 96 ( $D_ex 0 -$Radex)
 arc 96 97 ( $D_ex $Radex 0)


);





boundary
 (
    
 inlet
    {
        type patch;
        faces
        (
            (1 36 52 112)
            (36 40 58 52)
            (40 9 118 58)

            (0 44 36 1)
            (44 48 40 36)
            (48 8 9 40)

            (0 124 64 44)
            (64 70 48 44)
            (70 130 8 48)
        );
    }

          
 outlet
    {
        type patch;
        faces
        (

            (77 78 79 136)
            (78 81 80 79)
            (81 82 137 80)

            (76 87 78 77)
            (87 84 81 78)
            (84 83 82 81)

            (139 86 87 76)
            (86 85 84 87)
            (85 138 83 84)

            (96 76 77 97)

            (97 77 109 97)
            (77 136 144 109)
            (136 79 98 144)

            (79 80 99 98)

            (80 137 145 99)
            (137 82 110 145)
            (100 110 82 100)

            (83 101 100 82)

            (101 83 111 101)
            (146 111 83 138)
            (102 146 138 85)

            (103 102 85 86)

            (103 86 139 147)
            (147 139 76 108)
            (96 108 76 96)

        );
    }


 inj_inlet
    {
        type patch;
        faces
        (
            (32 34 35 33) 
        );
    }

 inj_wall
    {
        type wall;
        faces
        (
            (55 56 33 32)
            (55 61 34 32)
            (61 62 35 34)
            (62 56 33 35)
            
        );
    }


 nozzle_wall
    {
        type wall;
        faces
        (
            (1 112 113 3)
            (52 53 113 112)
            (58 59 53 52)
            (118 119 59 58)
            (9 11 119 118)
            (8 10 11 9)
            (130 131 10 8)
            (70 71 131 130)
            (70 71 65 64)
            (64 65 124 125)
            (124 125 2 0)
            (0 2 3 1)

            (10 12 13 11)
            (11 13 120 119)
            (119 120 60 59)
            (59 60 54 53)
            (53 54 114 113)
            (113 114 5 3)
            (2 4 5 3)
            (125 126 4 2)
            (65 66 126 125)
            (71 72 66 65)
            (131 132 72 71)
            (10 12 132 131)

            (12 20 21 13)
            (13 21 121 120)
            (120 121 61 60)
            (60 61 55 54)
            (54 55 115 114)
            (114 115 17 5)
            (5 17 16 4)
            (4 16 127 126)
            (126 127 67 66)
            (66 67 73 72)
            (72 73 133 132)
            (132 133 20 12)

            (20 22 23 21)
            (21 23 122 121)
            (121 122 62 61)
            (55 56 116 115)
            (115 116 19 17)
            (17 19 18 16)
            (16 18 128 127)
            (127 128 68 67)
            (67 68 74 73)
            (73 74 134 133)
            (133 134 22 20)

            (22 14 15 23)

            (23 15 123 122)
            (122 123 63 62)
            (62 63 57 56)
            (56 57 117 116)
            (116 117 7 19)
            (19 7 6 18)
            (18 6 129 128)
            (128 129 69 68)
            (68 69 75 74)
            (74 75 135 134)
            (134 135 14 22)

            

        );
    }



walls
    {
        type patch;
        faces
        (
    //front face
            (88 6 7 89)

            (89 7 105 89)
            (7 117 140 105)
            (117 57 90  140)

            (57 63 91 90)

            (63 123 141 91)
            (123 15 106 141)
            (92 106 15 92)

            (14 93 92 15)

            (93 14 107 93)
            (135 142 107 14)
            (75 94 142 135)

            (95 94 75 69)

            (143 95 69 129)
            (104 143 129 6)
            (88 104 6 88) 
 //lateral face

    (93 101 100 92)
    (92 100 110 106 )
    (106 110 141 145)
    (145 141 91 99)
    (90 99 98 91)
    ( 90 98 144 140)
    (140 144 109 105)
    (105 109 97 89)
    (89 97 96 88)
    (88 96 108 104)
    (104 108 147 143)
    (143 147 103 95)
    (95 103 102 94)
    (94 102 146 142)
    (142 146 111 107)
    (107 111 101 93)
    


        );
    }


);




mergePatchPairs
();

// ************************************************************************* //
