Nozzletest/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM: v2306                                                      |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
    // Create a cellSet from geometry
    {
        name    ignitionCells;
        type    cellSet;
        action  new;
        source  sphereToCell;

        sourceInfo
        {
            centre  (-0.092 0.082 0);   // ignition center (meters)
            radius  0.0075;     // ignition radius (meters)
        }
    }

    // Convert cellSet → cellZone
    {
        name    ignitionZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;

        sourceInfo
        {
            set ignitionCells;
        }
    }
);
